/******************************************************************************

                  版权所有 (C), 2016-2026, 深圳进化动力数码科技

 ******************************************************************************
  文 件 名   : ffmpeg.h
  版 本 号   : 初稿
  作    者   : 蒋小辉
  生成日期   : 2016年4月20日
  最近修改   :
  功能描述   : ffmpeg.c 的头文件
  函数列表   :
  修改历史   :
  1.日    期   : 2016年4月20日
    作    者   : 蒋小辉
    修改内容   : 创建文件

******************************************************************************/
#ifndef __FFMPEG_H__
#define __FFMPEG_H__


/*----------------------------------------------*
 * 包含头文件                                   *
 *----------------------------------------------*/
#include "main.h"



#ifdef __cplusplus
#if __cplusplus
extern "C"{
#endif
#endif /* __cplusplus */


/*----------------------------------------------*
 * 外部变量说明                                 *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 外部函数原型说明                             *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 内部函数原型说明                             *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 全局变量                                     *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 模块级变量                                   *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 常量定义                                     *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 宏定义                                       *
 *----------------------------------------------*/
#define   MAX_FILE_PATH_NAME_LEN    (128)  /*最大的文件名长度*/
#define   MAX_SHEEL_CMD_LEN         (512)  /*最大shell命令长度*/

/*----------------------------------------------*
 * 结构体类型定义                               *
 *----------------------------------------------*/
/* 媒体文件格式转换线程输入参数 */
typedef struct
{
    char input[MAX_FILE_PATH_NAME_LEN];   /*输入文件 包含路径*/
	char output[MAX_FILE_PATH_NAME_LEN];  /*输出文件 包含路径*/
}stMPath;


/*****************************************************************************
 函 数 名  : FFmpegH264ToMP4
 功能描述  : 传入h264帧数据，合成成流媒体格式的文件(.mp4格式):媒体frame可以按照自定义尺寸。
*****************************************************************************/
extern int FFmpegH264ToMP4(u8 *h264FrameDataBuf, u32 nDatalen, char *mediapath);


/*****************************************************************************
 函 数 名  : h264toflv_handle_thd
 功能描述  : 原始H264文件转换为.FLV文件操作线程
*****************************************************************************/
extern void* h264toflv_handle_thd(stMPath *pPath);


/*****************************************************************************
 函 数 名  : convert_yuv_to_photo
 功能描述  : yuv帧数据转换为照片文件(jpg 或者缩略图)文件
*****************************************************************************/
extern void* convert_yuv_to_photo(unsigned char *yuv, const int width_in, const int height_in, const int width_out, const int height_out, const char *fimagename);



#ifdef __cplusplus
#if __cplusplus
}
#endif
#endif /* __cplusplus */


#endif /* __FFMPEG_H__ */


