/******************************************************************************

                  版权所有 (C), 2016-2026, 深圳进化动力数码科技有限公司

 ******************************************************************************
  文 件 名   : mcu.h
  版 本 号   : 初稿
  作    者   : 彭斌全
  生成日期   : 2016年4月18日
  最近修改   :
  功能描述   : mcu.c 的头文件
  函数列表   :
  修改历史   :
  1.日    期   : 2016年4月18日
    作    者   : 彭斌全
    修改内容   : 创建文件

******************************************************************************/

#ifndef __MCU_H__
#define __MCU_H__

/*----------------------------------------------*
 * 包含头文件                                   *
 *----------------------------------------------*/
#include <sys/socket.h>

#ifdef __cplusplus
#if __cplusplus
extern "C"{
#endif
#endif /* __cplusplus */

/*----------------------------------------------*
 * 外部变量说明                                 *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 外部函数原型说明                             *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 内部函数原型说明                             *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 全局变量                                     *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 模块级变量                                   *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 常量定义                                     *
 *----------------------------------------------*/

/* sock_mm默认IP地址，获取 eth0 IP地址失败时使用 */
#define SOCK_MM_IP_ADDR             "192.168.0.178"
#define SOCK_MM_PORT                5555

#define MCU_MAX_MAGIC_LEN           6

/*----------------------------------------------*
 * 宏定义                                       *
 *----------------------------------------------*/
#define MCU_CMD_KEEP_ALIVE          0   /* 发送MCU通道保活心跳包 */
#define MCU_ACK_VOLT_QUERY          1   /* 电量查询结果回应Dock板 */
#define MCU_OP_MODE_CHANG           2   /* 模式切换操作通知Dock板 */
#define MCU_OP_SHOOT_OPERA          3   /* 拍摄操作通知Dock板 */
#define MCU_CMD_QUERY_VOLT          4   /* 查询电量命令 */
#define MCU_CMD_CHANG_MODE_LIGHT    5   /* 切换模式灯命令 */
#define MCU_CMD_CHANG_POWER_LIGHT   6   /* 切换电源灯命令 */

#define MCU_DEBUG_SWITCH            0   /* MCU调试开关 */

/*----------------------------------------------*
 * 枚举类型定义                                 *
 *----------------------------------------------*/
typedef enum {
	LED_STATUS_GS   = 0,
	LED_STATUS_OS   = 1,
	LED_STATUS_RS   = 2,
	LED_STATUS_GB_1 = 3,
	LED_STATUS_OB_1 = 4,
	LED_STATUS_RB_1 = 5,
	LED_STATUS_GB_4 = 6,
	LED_STATUS_RB_4 = 7,
	LED_STATUS_OB_4 = 8,
} PowerStatusVaule;

/*----------------------------------------------*
 * 结构体类型定义                               *
 *----------------------------------------------*/
/* MCU通用报文格式 */
struct mcu_packet
{
    u8 magic[MCU_MAX_MAGIC_LEN];    /* 识别key，命令：Mcmd，回应：Mack */
    u8 type;                        /* 命令和回应的类型 */
    u8 data;                        /* 命令和回应的数据 */
};

/*****************************************************************************
 函 数 名  : send_mcu_cmd_pkt
 功能描述  : 发送MCU命令报文实现函数
*****************************************************************************/
extern void send_mcu_cmd_pkt(u8 ucCmd, u8 ucData);

/*****************************************************************************
 函 数 名  : mcu_init
 功能描述  : MCU初始化实现函数
*****************************************************************************/
extern void mcu_init(stDock *pstDock);

/*****************************************************************************
 函 数 名  : set_power_status
 功能描述  : 设置电源灯状态实现函数
*****************************************************************************/
extern void set_power_status(stDock *pstDock);

/*****************************************************************************
 函 数 名  : set_power_status
 功能描述  : 设置模式灯状态实现函数
*****************************************************************************/
extern void set_mode_status(stDock *pstDock);

#ifdef __cplusplus
#if __cplusplus
}
#endif
#endif /* __cplusplus */


#endif /* __MCU_H__ */

