/******************************************************************************

                  版权所有 (C), 2016-2026, 深圳进化动力数码科技有限公司

 ******************************************************************************
  文 件 名   : video.c
  版 本 号   : 初稿
  作    者   : 彭斌全
  生成日期   : 2016年4月19日
  最近修改   :
  功能描述   : 录像操作相关函数实现
  函数列表   :
              photo_opera_handle
  修改历史   :
  1.日    期   : 2016年4月19日
    作    者   : 彭斌全
    修改内容   : 创建文件

******************************************************************************/

/*----------------------------------------------*
 * 包含头文件                                   *
 *----------------------------------------------*/
#include "include/video.h"

/*----------------------------------------------*
 * 外部变量说明                                 *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 外部函数原型说明                             *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 内部函数原型说明                             *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 全局变量                                     *
 *----------------------------------------------*/
bool g_video_flag = false;   /*正在录像的标志*/
bool g_writing_file_flag = false;  /*正在写入文件标志*/

/*----------------------------------------------*
 * 模块级变量                                   *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 常量定义                                     *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 宏定义                                       *
 *----------------------------------------------*/
#define MAX_CONVERT_THREAD_NUM    (4)   /*媒体文件转换(h264 -> flv)线程个数*/

/*----------------------------------------------*
 * 结构体类型定义                               *
 *----------------------------------------------*/



/*****************************************************************************
 函 数 名  : video_opera_handle
 功能描述  : 录像操作处理接口实现函数
 输入参数  : stDock * pstDock
 输出参数  : 无
 返 回 值  :
 调用函数  :
 被调函数  :

 修改历史      :
  1.日    期   : 2016年4月19日
    作    者   : 彭斌全
    修改内容   : 新生成函数
  2.日	期	   : 2016年4月20日
	作	者	   : 蒋小辉
	修改内容   : 函数功能的实现

*****************************************************************************/
int video_opera_handle(stDock * pstDock)
{
	if (NULL == pstDock)
	{
		msg("(%s, %d)para error !", __FUNCTION__, __LINE__);
		return -1;
	}

	if (SYS_STATUS_READY == pstDock->ucSysStatus)
	{
		g_video_flag = true;  //设置正在录像的标志

		/*唤醒球机控制线程，发送开始录像命令*/
	    send_ball_cmd_pkt(BALL_CMD_START_VIDEO, 0);
	}
	if (SYS_STATUS_VIDEO == pstDock->ucSysStatus)
	{
		g_video_flag = false;  //清除正在录像的标志
		g_writing_file_flag = false;  //清除正在写入文件的标志

		/*唤醒球机控制线程，发送停止录像命令*/
		send_ball_cmd_pkt(BALL_CMD_STOP_VIDEO, 0);

		//线程后台操作:读取原始素材文件.264转换成原始媒体文件.flv ，4个文件4个线程处理
		pthread_t hthread[MAX_CONVERT_THREAD_NUM];
		stMPath sPara[MAX_CONVERT_THREAD_NUM];
		int res = -1;
		int i = 0;

		//memset(&sPara[i], 0, sizeof(stMPath));
		//todo 读取原始素材文件路径到stMPath结构体，4个文件

		for (i = 0; i < MAX_CONVERT_THREAD_NUM; i++)
		{
			res = pthread_create(&hthread[i], NULL, (void *)h264toflv_handle_thd, &sPara[i]);
			if (res != 0)
			{
    			int errno;

		    	msg("pthread_create fail:%d errno\n", errno);
				return -1;
		    }
	    }

		for (i = 0; i < MAX_CONVERT_THREAD_NUM; i++)
		{
			if (0 != pthread_join(hthread[i], NULL))
			{
				msg("pthread_join error !\n");
				return -1;
			}
		}
	}

    return 0;
}


